{
 "projects": [
  {
   "id": 0,
   "build": "Next.js / React / Typescript Prisma / MongoDB / SCSS",
   "name": "Wagerly",
   "desc": "A social platform for sports fans and sports betters. Post, follow, comment, like, join communties and view live sports scores and odds.",
   "site": "https://oddspot.vercel.app/",
   "repo": "https://github.com/jDelille/fullstack-next-prisma",
   "image": "../images/wagerly.png",
   "npm": false,
   "link": "wagerly",
   "projectName": "Wagerly",
   "projectBio": "A social platform for sports fans and sports betters.",
   "projectImageSmall": "../images/wagerly/wagerly-small.png",
   "projectRole": "Full-stack developer",
   "projectContext": "Personal Project",
   "projectPeriod": "2023",
   "projectBackgroundText": "WAGERLY",
   "projectIntro": "Wagerly is a social platform built for sports fans and sports betters. Post your bets, interact with other users, and create communities where you can discuss your favorite teams, sports, or daily picks. Join for free and be part of the community!",
   "projectPurpose": "I decided to create Wagerly to practice full stack development using Nextjs13 and Prisma. Creating a social platform is a great way to practice best coding practices and learn new technologies. Also, by creating a site of this size, it's a great way to practice working with a lot of code and making a site thats not only nice to look at and fun to interact with, but also fast and engaging. ",
   "projectBuild": "This project was built using Nextjs 13 new app directory, React, TypeScript, Prisma, MongoDB, SCSS, and a few ESPN apis. To see how this site was built, check out the github repository for it. Also, if you want to help out on this site, feel free to make some pull requests!",
   "projectImageLarge": "../images/wagerly/wagerly-big.png",
   "nextProject": "Muunifi",
   "nextProjectLink": "/muunifi",
   "projectColor": "#20b46a",
   "nextIsNPM": false,
   "projectWebsiteLink": "https://wagerly.vercel.app/"
  },
  {
   "id": 1,
   "build": "Next.js / React / Typescript / Mobx / Firebase",
   "name": "Muunifi",
   "desc": "Follow along, subscribe for exclusive access, create your own content or build your own community through muunifi’s specific social financial tools.",
   "site": "",
   "repo": "",
   "image": "../public/images/vibro-light.png",
   "npm": false,
   "link": "muunifi",
   "projectName": "Muunifi",
   "projectBio": "Social platform built for financial communities",
   "projectImageSmall": "../images/muunifi-laptop.png",
   "projectRole": "Front-End Developer",
   "projectContext": "808 Partners",
   "projectPeriod": "2023",
   "projectBackgroundText": "MUUNIFI",
   "projectIntro": "Follow along, subscribe for exclusive access, create your own content or build your own community through Muunifi’s specific social financial tools. Muunifi is your source for all the greatest alpha, financial education, and latest news on what’s breaking and up-and-coming in markets. Unfortunately, the Muunifi project was discontinued. While the site is still up, the database is no longer active.",
   "projectPurpose": "Muunifi is a social platform created for people who want to get the latest and best financial advice from experts in the field. Muunifi is designed to overturn the existing socail media models and give power back to the users. Users will be able to share their own content and charge users for subscription level access to their content that is reserved for those in their inner circle.",
   "projectBuild": "Muunifi was built using Next.js, React, TypeScript, MobX, Firebase, Axios, and many other great dependencies to keep the code consistent and production ready. The code is kept clean and easy to read thanks to the software design principle, 'Seperation of concerns'. This allowed the developers to separate different parts of a software system into distinct modules, each responsible for a specific set of functionalities. By doing this, each module can be developed, tested, and maintained independently, which can make the overall system more flexible, scalable, and maintainable.",
   "projectImageLarge": "../images/muunifi/muunifi-big.png",
   "nextProject": "Fretify",
   "nextProjectLink": "/fretify",
   "projectColor": "#7367FE",
   "nextIsNPM": false
  },
  {
   "id": 2,
   "build": "React / TypeScript / Scss ",
   "name": "Fretify - Interactive Guitar App",
   "desc": "Interactive guitar fretboard created to make guitarists lives easier when learning new shapes and scales across the neck.",
   "site": "https://fretify.netlify.app/",
   "repo": "https://github.com/jDelille/fretify",
   "image": "../public/images/vibro-light.png",
   "npm": false,
   "link": "fretify",
   "projectName": "Fretify",
   "projectBio": "Interactive Guitar Fretboard Website",
   "projectImageSmall": "../images/fretify-laptop.png",
   "projectRole": "Front-End Developer",
   "projectContext": "Personal Project",
   "projectPeriod": "2023",
   "projectBackgroundText": "FRETIFY",
   "projectIntro": "Fretify is an interactive guitar fretboard website. Learn over 50 scales down the neck in every key and 'almost' every tuning. (more coming soon...). View on your browser or on the go on your mobile device, thanks to its user friendly mobile UI.",
   "projectPurpose": "Being a guitar playing who loves to learn more about what I'm doing when I play music, I spend a lot of time looking at scale charts to become more familiar with the fretboard. I was tired of looking at old PNG files on the web to learn scales so I decided to take matters into my own hands, thus Fretify was born. Not only did it help me become a better guitarist, but it helped me become a better developer by creating the website with the best technologies and best practices.",
   "projectBuild": "Fretify was built using React, TypeScript, SCSS, MobX, Tone.js and Tonal.js. I felt this was a good enough choice of technology for this site since it is pretty minimalist. However, I plan on expanding this project in the future. I want to incorportate Firebase so I can create user profiles and a community chat board where users can discuss everything guitar. I also want to use Next.js to handling routing and server side rendering.",
   "projectImageLarge": "../images/fretify/fretify-big.png",
   "nextProject": "jd-react-select",
   "nextProjectLink": "/jd-react-select",
   "projectColor": "#3D5AF1",
   "nextIsNPM": true,
   "projectWebsiteLink": "https://fretify.netlify.app/"
  },
  {
   "id": 3,
   "build": "React / Typescript",
   "name": "jd-react-select",
   "desc": "A reusable, lightweight, and easy to use react select component I created with TypeScript.",
   "site": "https://www.npmjs.com/package/jd-react-select",
   "repo": "https://github.com/jDelille/react-select",
   "image": "../public/images/vibro-light.png",
   "npm": true,
   "link": "jd-react-select",
   "projectName": "jd-react-select",
   "projectBio": "A reusable, lightweight, and easy to use react select component.",
   "projectImageSmall": "../images/muunifi-laptop.png",
   "projectRole": "Front-End Developer",
   "projectContext": "Personal Project",
   "projectPeriod": "2023",
   "projectBackgroundText": "SELECT",
   "projectIntro": "jd-react-select aims to be a lightweight, reusable and easy-to-use react select-component. With its customizable props and styles, jd-react-select is a great choice for developers who want a reusable select component that provides consistent functionality and styles in their projects.",
   "projectPurpose": "I decided to create jd-react-select as a way to teach myself how to write better TypeScript and better reusable components that can be easily integrated into any project. Additionally, building this package allowed me to get familiar with how to create packages, write good documentation, and help other developers who might be looking for a high-quality, customizable, and easy-to-use select component for their projects.",
   "projectBuild": "This package was built using TypeScript and React. I decided to keep this package lightweight and not include any more dependencies. The styling for this package is done using SCSS, although it is quite minimal. I wanted to start people off with a simple and clean select component design, and leave the rest up to them!",
   "projectImageLarge": "../images/muunifi.png",
   "nextProject": "Wagerly",
   "nextProjectLink": "/wagerly",
   "projectColor": "#c62b2e",
   "nextIsNPM": false,
   "projectWebsiteLink": "https://www.npmjs.com/package/jd-react-select"
  }
 ]
}